source/_posts/2016-01-31-django-uwsgi部署.html
---
title: "uwsgi部署Django服务的坑"
date: 2016-01-31
layout: post
categories: [uwsgi, django]
published: true
comments: true
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">uwsgi部署Django服务</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">部署Django的方式</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>gunicorn + Nginx
</li>
<li>uwsgi + Nginx
</li>
</ul>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">gunicorn + Nginx</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
<a href="http://gunicorn.org">http://gunicorn.org</a> 最大的好处就是部署简单，如果没有特殊要求，推荐使用这种方式部署Python Web程序
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">uwsgi + Nginx</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
uwsgi 相对 gunicorn来说配置选项相对复杂，但是uwsgi是支持websocket的，出于这个原因选择uwsgi来部署django程序
</p>
</div>

<ul class="org-ul"><li>问题1：uwsgi的默认监听进程的数量100<br  /><div class="outline-text-5" id="text-1-1-2-1">
<p>
解决： 之前由于只知道启动uwsgi worker的数量，不管怎么调worker的数量，并发都很低，<br  />
配置listen参数解决，根据服务器配置和访问来决定，目前我开的是20000
</p>
</div>
</li>

<li>问题2：supervisor没有办法优雅的重启uwsgi worker，导致服务器资源被重启的uwsgi进程占满<br  /><div class="outline-text-5" id="text-1-1-2-2">
<p>
解决：配置no-orphans参数
</p>
</div>
</li>

<li>配置范例<br  /><div class="outline-text-5" id="text-1-1-2-3">
<div class="org-src-container">

<pre class="src src-ini">master = true
processes = 8
thread = 100
thread-stacksize = 512
stats = 127.0.0.1:9194
buffer-size = 65535
enable-threads = true
http-timeout = 60
socket-timeout = 60
chmod-socket = 666
harakiri = 60
max-requests = 20000
listen = 20000
no-orphans
</pre>
</div>

<p>
<!-- more -->
</p>
</div>
</li></ul>
</div>
</div>
</div>
